e2e/artillery/artillery-config.ci.yaml
config:
  target: "{{ $env.BASE_URL }}"
  phases:
    - name: "{{ $env.STAGE_VUS }} VU cloud stage"
      duration: 5
      arrivalCount: "{{ $env.STAGE_VUS }}"
  processor: "./all-scenarios.js"
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport: null
  ensure:
    maxErrorRate: 1

scenarios:
  - name: Full browser journey
    engine: playwright
    flowFunction: allScenarios