e2e/artillery/artillery-config.yaml
config:
  target: "{{ $env.BASE_URL }}"
  phases:
    - name: "phase 1"
      duration: "{{ $env.PHASE1_DURATION }}"
      arrivalCount: "{{ $env.PHASE1_ARRIVAL_COUNT }}"
  processor: "./all-scenarios.js"
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport: null

scenarios:
  - name: smoke
    engine: playwright
    flowFunction: smokeScenarios
  - name: full
    engine: playwright
    flowFunction: allScenarios